# epm 테이블로 연습

In [1]:
import numpy as np
import pandas as pd

In [13]:
emp = pd.read_csv('../file/emp.csv', parse_dates=['HIREDATE'])
emp.head()

   EMPNO   ENAME       JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

In [20]:
# 컬럼명 소문자로
emp.columns = emp.columns.str.lower()
emp.head()

   empno   ename       job     mgr   hiredate   sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

```
select * from emp;
```

In [11]:
emp
# 데이터를 다 데려오는건 위험하긴한데 연습용이니 괜찮 ㅎㅎ

    EMPNO   ENAME        JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

```
select ename from emp;
```

In [24]:
emp['ename']

0      SMITH
1      ALLEN
2       WARD
3      JONES
4     MARTIN
5      BLAKE
6        CCC
7      SCOTT
8       KING
9     TURNER
10     ADAMS
11     JAMES
12      FORD
13    MILLER
Name: ename, dtype: object

In [23]:
emp[['ename']]

     ename
0    SMITH
1    ALLEN
2     WARD
3    JONES
4   MARTIN
5    BLAKE
6      CCC
7    SCOTT
8     KING
9   TURNER
10   ADAMS
11   JAMES
12    FORD
13  MILLER

In [35]:
print(type(emp['ename'])) # Series
print(type(emp[['ename']])) # DataFrame
print(len(emp['ename']))
print(len(emp[['ename']]))
print(emp['ename'].shape)
print(emp[['ename']].shape)

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
14
14
(14,)
(14, 1)

```
select empno, ename from emp;
```

In [21]:
emp[['empno', 'ename']]

    empno   ename
0    7369   SMITH
1    7499   ALLEN
2    7521    WARD
3    7566   JONES
4    7654  MARTIN
5    7698   BLAKE
6    7782     CCC
7    7788   SCOTT
8    7839    KING
9    7844  TURNER
10   7876   ADAMS
11   7900   JAMES
12   7902    FORD
13   7934  MILLER

## iloc
```
iloc[줄, 칸] # 인덱스로 접근
```

In [63]:
emp.iloc[ 0 ]

empno                      7369
ename                     SMITH
job                       CLERK
mgr                      7902.0
hiredate    1980-12-17 00:00:00
sal                         800
comm                        NaN
deptno                       20
Name: 0, dtype: object

In [64]:
emp.iloc[ [0,3,5,7] ]

   empno  ename      job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH    CLERK  7902.0 1980-12-17   800   NaN      20
3   7566  JONES  MANAGER  7839.0 1981-04-02  2975   NaN      20
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850   NaN      30
7   7788  SCOTT  ANALYST  7566.0 1987-07-13  3000   NaN      20

In [66]:
emp.iloc[ 0:4 ]

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30
3   7566  JONES   MANAGER  7839.0 1981-04-02  2975    NaN      20

In [67]:
emp.iloc[ 0, 0 ]

7369

In [83]:
emp.iloc[ [1,3,5,7], [1,2,-1] ]

   ename       job  deptno
1  ALLEN  SALESMAN      30
3  JONES   MANAGER      20
5  BLAKE   MANAGER      30
7  SCOTT   ANALYST      20

In [104]:
emp.iloc[ 3:10, 1:7 ]

    ename        job     mgr   hiredate   sal    comm
3   JONES    MANAGER  7839.0 1981-04-02  2975     NaN
4  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0
5   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN
6     CCC    MANAGER  7839.0 1981-06-09  2450     NaN
7   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN
8    KING  PRESIDENT     NaN 1981-11-17  5000     NaN
9  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0

In [106]:
emp.iloc[[0,3,5],:]

   empno  ename      job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH    CLERK  7902.0 1980-12-17   800   NaN      20
3   7566  JONES  MANAGER  7839.0 1981-04-02  2975   NaN      20
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850   NaN      30

## loc
```
loc[인덱스값, 컬럼값] # 값으로 접근
```

In [107]:
emp.loc[ 0:2, 'empno' ]

0    7369
1    7499
2    7521
Name: empno, dtype: int64

In [109]:
t = ['empno', 'ename']

emp.loc[ 0:2, t ]

   empno  ename
0   7369  SMITH
1   7499  ALLEN
2   7521   WARD

In [111]:
emp.loc[ 0:3, 'empno':'mgr' ]

   empno  ename       job     mgr
0   7369  SMITH     CLERK  7902.0
1   7499  ALLEN  SALESMAN  7698.0
2   7521   WARD  SALESMAN  7698.0
3   7566  JONES   MANAGER  7839.0

<font color='red'>loc의 슬라이싱(:)은 이상:이하로 취급</fort>

잘 가져와보자
```
SALESMAN	7698	1981-02-20 00:00:00
SALESMAN	7698	1981-02-22 00:00:00
MANAGER		7839	1981-04-02 00:00:00
SALESMAN	7698	1981-09-28 00:00:00
```

In [124]:
emp.iloc[1:5,2:5]

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

In [125]:
emp.loc[1:4,'job':'hiredate']

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

## 조건
```
df[ 조건 ][ 컬럼 ]

df[ 조건 ][ [컬럼1,컬럼2] ]

df[ 컬럼 ][ 조건 ]

df[ [컬럼1,컬럼2] ][ 조건 ]
```

```
select empno, empno from emp;
```

In [148]:
emp[ ['empno','ename'] ]

    empno   ename
0    7369   SMITH
1    7499   ALLEN
2    7521    WARD
3    7566   JONES
4    7654  MARTIN
5    7698   BLAKE
6    7782     CCC
7    7788   SCOTT
8    7839    KING
9    7844  TURNER
10   7876   ADAMS
11   7900   JAMES
12   7902    FORD
13   7934  MILLER

```
select * from emp where deptno=10;
```

In [130]:
emp[ emp['deptno']==10 ]

    empno   ename        job     mgr   hiredate   sal  comm  deptno
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450   NaN      10
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000   NaN      10
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300   NaN      10

```
select empno, ename from emp where deptno=10;
```

In [138]:
emp[ emp['deptno']==10 ].loc[:,['empno','ename']]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

In [146]:
emp.loc[:,['empno','ename']][ emp['deptno']==10 ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

In [143]:
emp[ emp['deptno']==10 ][ ['empno','ename'] ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

In [144]:
emp[ ['empno','ename'] ][ emp['deptno']==10 ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

### 멀티조건

and: &

or: |
```
df[ (조건) & ( (조건) | (조건) ) ]
```

```
select empno, ename from emp where deptno=10 and sal>2000;
```

In [168]:
emp[ ['empno','ename','sal'] ][ ( emp['deptno']==10 ) & ( emp['sal']>2000 ) ]

   empno ename   sal
6   7782   CCC  2450
8   7839  KING  5000

### 서브쿼리 비추비추

```
select job from emp where empno=7369;

select ename, job from emp where job=(select job from emp where empno=7369);
```
```
SMITH	CLERK
ADAMS	CLERK
JAMES	CLERK
MILLER	CLERK
```

In [186]:
emp[ 'job' ][ emp['empno']==7369 ].values[0]

'CLERK'

In [187]:
job = emp[ 'job' ][ emp['empno']==7369 ].values[0]

emp[ ['ename','job'] ][ emp['job']==job ]

     ename    job
0    SMITH  CLERK
10   ADAMS  CLERK
11   JAMES  CLERK
13  MILLER  CLERK

```
select job from emp where deptno=10;

select ename, job from emp where job in (select job from emp where deptno=10);
```
```
CLARK	MANAGER
BLAKE	MANAGER
JONES	MANAGER
KING	PRESIDENT
MILLER	CLERK
JAMES	CLERK
ADAMS	CLERK
SMITH	CLERK
```

In [211]:
emp[ 'job' ][ emp['deptno']==10 ].values.tolist()

['MANAGER', 'PRESIDENT', 'CLERK']

In [213]:
jobs_arr = emp[ 'job' ][ emp['deptno']==10 ].values
jobs_list = emp[ 'job' ][ emp['deptno']==10 ].values.tolist()

emp[ ['ename','job'] ][ emp['job'].isin(jobs_arr) ]

     ename        job
0    SMITH      CLERK
3    JONES    MANAGER
5    BLAKE    MANAGER
6      CCC    MANAGER
8     KING  PRESIDENT
10   ADAMS      CLERK
11   JAMES      CLERK
13  MILLER      CLERK

### 문자열 합치기

```
select job||ename from emp;
select concat(job, ename) from emp;
```

In [215]:
emp['job'] + emp['ename']

0         CLERKSMITH
1      SALESMANALLEN
2       SALESMANWARD
3       MANAGERJONES
4     SALESMANMARTIN
5       MANAGERBLAKE
6         MANAGERCCC
7       ANALYSTSCOTT
8      PRESIDENTKING
9     SALESMANTURNER
10        CLERKADAMS
11        CLERKJAMES
12       ANALYSTFORD
13       CLERKMILLER
dtype: object

### as
```
select sal, sal*12 as asal from emp;
```

In [257]:
asal = ( emp[['sal']]*12 ).rename( columns={'sal':'asal'} )

pd.concat([ emp[['sal']],asal ], axis=1 )

     sal   asal
0    800   9600
1   1600  19200
2   1250  15000
3   2975  35700
4   1250  15000
5   2850  34200
6   2450  29400
7   3000  36000
8   5000  60000
9   1500  18000
10  1100  13200
11   950  11400
12  3000  36000
13  1300  15600

In [ ]:
empcp = emp.copy()
empcp['asal'] = empcp['sal']*12
empcp[['sal','asal']]
empcp